app/controllers/items_controller.rb

  def find_item_and_category
    @category = Category.find(params[:category_id])
    @item = Item.find(params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]