app/views/categories/show.html.erb

<h2><%=@category.name%></h2>
<% @category.items.each do |item| %>
---
SELECT "items".* FROM "items" WHERE "items"."category_id" = ?  [["category_id", 1]]